IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/GPIO1_GPIO1.xml
<module name="GPIO1_GPIO1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="GPIO1_PID" acronym="GPIO1_PID" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Current scheme" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1155" description="Function code assigned to TCP3" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x5" description="RTL Version R code" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision X code" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version code" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x5" description="Minor revision Y code" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="GPIO1_PCR" acronym="GPIO1_PCR" offset="0x4" width="8" description="">
		<bitfield id="SOFT" width="1" begin="1" end="1" resetval="0x0" description="Used in conjunction with FREE bit to determine the emulation suspend mode." range="1" rwaccess="RO"/> 
		<bitfield id="FREE" width="1" begin="0" end="0" resetval="0x1" description="For GPIO, the FREE bit is fixed at 1, which means GPIO runs free in emulation suspend." range="0" rwaccess="RO"/>
	</register>
	<register id="GPIO1_BINTEN" acronym="GPIO1_BINTEN" offset="0x8" width="32" description="">
		<bitfield id="EN" width="16" begin="15" end="0" resetval="0x0" description="Per bank interrupt enable. 0 = disable, 1 = enable." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_DIR01" acronym="GPIO1_DIR01" offset="0x10" width="32" description="">
		<bitfield id="DIR1" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 1 bits, 0 = output, 1 = input." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="DIR0" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 0 bits, 0 = output, 1 = input." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_OUT_DATA01" acronym="GPIO1_OUT_DATA01" offset="0x14" width="32" description="">
		<bitfield id="OUT1" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 1 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="OUT0" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 0 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_SET_DATA01" acronym="GPIO1_SET_DATA01" offset="0x18" width="32" description="">
		<bitfield id="SET1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 1 bits. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SET0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 0 bits. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_CLR_DATA01" acronym="GPIO1_CLR_DATA01" offset="0x1C" width="32" description="">
		<bitfield id="CLR1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLR0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_IN_DATA01" acronym="GPIO1_IN_DATA01" offset="0x20" width="32" description="">
		<bitfield id="IN1" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 1 bits." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="IN0" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 0 bits." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="GPIO1_SET_RIS_TRIG01" acronym="GPIO1_SET_RIS_TRIG01" offset="0x24" width="32" description="">
		<bitfield id="SETRIS1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 1 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETRIS0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 0 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_CLR_RIS_TRIG01" acronym="GPIO1_CLR_RIS_TRIG01" offset="0x28" width="32" description="">
		<bitfield id="CLRRIS1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 1 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRRIS0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 0 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_SET_FAL_TRIG01" acronym="GPIO1_SET_FAL_TRIG01" offset="0x2C" width="32" description="">
		<bitfield id="SETFAL1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 1 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETFAL0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 0 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_CLR_FAL_TRIG01" acronym="GPIO1_CLR_FAL_TRIG01" offset="0x30" width="32" description="">
		<bitfield id="CLRFAL1" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 1 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRFAL0" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 0 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_INTSTAT01" acronym="GPIO1_INTSTAT01" offset="0x34" width="32" description="">
		<bitfield id="STAT1" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 0 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="STAT0" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 0 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_DIR23" acronym="GPIO1_DIR23" offset="0x38" width="32" description="">
		<bitfield id="DIR3" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 3 bits, 0 = output, 1 = input." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="DIR2" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 2 bits, 0 = output, 1 = input." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_OUT_DATA23" acronym="GPIO1_OUT_DATA23" offset="0x3C" width="32" description="">
		<bitfield id="OUT3" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 3 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="OUT2" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 2 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO1_SET_DATA23" acronym="GPIO1_SET_DATA23" offset="0x40" width="32" description="">
		<bitfield id="SET3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 3 bits. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SET2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 2 bits. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
